// import moment from 'moment/moment';

export const localeList = [
  'af', 'ar', 'ar-dz', 'ar-kw', 'ar-ly', 'ar-ma', 'ar-sa', 'ar-tn', 'az', 'be', 'bg', 'bm', 'bn', 'bn-bd',
  'bo', 'br', 'bs', 'ca', 'cs', 'cy', 'da', 'de', 'de-at', 'de-ch', 'el', 'en', 'en-au', 'en-ca', 'en-gb',
  'en-ie', 'en-il', 'en-in', 'en-nz', 'en-sg', 'eo', 'es', 'es-do', 'es-mx', 'es-us', 'et', 'eu', 'fa',
  'fi', 'fil', 'fo', 'fr', 'fr-ca', 'fr-ch', 'fy', 'ga', 'gd', 'gl', 'gu', 'hi', 'hr', 'hu', 'hy-am',
  'is', 'it', 'it-ch', 'ja', 'jv', 'ka', 'kk', 'km', 'kn', 'ko', 'ku', 'ky', 'lb', 'lo', 'lt', 'lv',
  'mi', 'mk', 'ml', 'mn', 'mr', 'ms', 'ms-my', 'mt', 'my', 'nb', 'ne', 'nl', 'nl-be', 'nn', 'pl', 'pt',
  'pt-br', 'ro', 'ru', 'sd', 'se', 'si', 'sk', 'sl', 'sq', 'sr', 'sv', 'sw', 'ta', 'te', 'tg', 'th',
  'tk', 'tr', 'tzm', 'ug-cn', 'uk', 'ur', 'uz', 'vi', 'yo', 'zh-cn', 'zh-hk', 'zh-tw'
];

Object.freeze(localeList);

export function normalizeLocale(name: string): string {
  if (!Intl?.DateTimeFormat)
    return 'en';

  return name.replace(/_/g, '-').toLowerCase();
}

function reduceLocale(locale: string): string {
  return locale.replace(/-[^-]*?$/i, '');
}

/* eslint-disable quote-props */
// noinspection SpellCheckingInspection
const meridiems = {
  'af': [['vm', 'VM'], ['nm', 'NM']],
  'ar': [['ص'], ['م']],
  'az': [['gecə'], ['gecə'], ['gecə'], ['gecə'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam']],
  'be': [['ночы'], ['ночы'], ['ночы'], ['ночы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара']],
  'bn': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bn-bd': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['ভোর'], ['ভোর'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['সন্ধ্যা'], ['সন্ধ্যা'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bo': [['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['དགོང་དག'], ['དགོང་དག'], ['དགོང་དག'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ']],
  'br': [['a.m.'], ['g.m.']],
  'el': [['πμ', 'ΠΜ'], ['μμ', 'ΜΜ']],
  'eo': [['a.t.m.', 'A.T.M.'], ['p.t.m.', 'P.T.M.']],
  'fa': [['قبل از ظهر'], ['بعد از ظهر']],
  'gu': [['રાત'], ['રાત'], ['રાત'], ['રાત'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['સાંજ'], ['સાંજ'], ['સાંજ'], ['રાત'], ['રાત'], ['રાત'], ['રાત']],
  'hi': [['रात'], ['रात'], ['रात'], ['रात'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['शाम'], ['शाम'], ['शाम'], ['रात'], ['रात'], ['रात'], ['रात']],
  'hu': [['de', 'DE'], ['du', 'DU']],
  'hy': [['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան']],
  'ja': [['午前'], ['午後']],
  'jv': [['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['siyang'], ['siyang'], ['siyang'], ['siyang'], ['sonten'], ['sonten'], ['sonten'], ['sonten'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu']],
  'km': [['ព្រឹក'], ['ល្ងាច']],
  'kn': [['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ']],
  'ko': [['오전'], ['오후']],
  'ku': [['به‌یانی'], ['ئێواره‌']],
  'lo': [['ຕອນເຊົ້າ'], ['ຕອນແລງ']],
  'ml': [['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി']],
  'mn': [['ҮӨ'], ['ҮХ']],
  'mr': [['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['सायंकाळी'], ['सायंकाळी'], ['सायंकाळी'], ['रात्री'], ['रात्री'], ['रात्री'], ['रात्री']],
  'ms': [['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['tengahari'], ['tengahari'], ['tengahari'], ['tengahari'], ['petang'], ['petang'], ['petang'], ['petang'], ['malam'], ['malam'], ['malam'], ['malam'], ['malam']],
  'ne': [['राति'], ['राति'], ['राति'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['साँझ'], ['साँझ'], ['साँझ'], ['साँझ'], ['राति'], ['राति'], ['राति'], ['राति']],
  'ru': [['ночи'], ['ночи'], ['ночи'], ['ночи'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера']],
  'sd': [['صبح'], ['شام']],
  'si': [['පෙ.ව.', 'පෙර වරු'], ['ප.ව.', 'පස් වරු']],
  'sq': [['PD'], ['MD']],
  'ta': [[' யாமம்'], [' யாமம்'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' காலை'], [' காலை'], [' காலை'], [' காலை'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' மாலை'], [' மாலை'], [' மாலை'], [' மாலை'], [' யாமம்'], [' யாமம்']],
  'te': [['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['సాయంత్రం'], ['సాయంత్రం'], ['సాయంత్రం'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి']],
  'tg': [['шаб'], ['шаб'], ['шаб'], ['шаб'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['бегоҳ'], ['бегоҳ'], ['бегоҳ'], ['шаб'], ['шаб'], ['шаб'], ['шаб'], ['шаб']],
  'th': [['ก่อนเที่ยง'], ['หลังเที่ยง']],
  'tr': [['öö', 'ÖÖ'], ['ös', 'ÖS']],
  'ug': [['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['سەھەر'], ['سەھەر'], ['سەھەر'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈش'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ']],
  'uk': [['ночі'], ['ночі'], ['ночі'], ['ночі'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора']],
  'ur': [['صبح'], ['شام']],
  'vi': [['sa', 'SA'], ['ch', 'CH']],
  'zh': [['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['早上'], ['早上'], ['早上'], ['上午'], ['上午'], ['上午'], ['中午'], ['下午'], ['下午'], ['下午'], ['下午'], ['下午'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上']],
};

export function getMeridiems(locale: string): string[][] {
  let result: string[][] = null;

  locale = normalizeLocale(locale);

  do {
    result = meridiems[locale];
    locale = reduceLocale(locale);
  } while (!result && locale.includes('-'));

  if (!result)
    result = [['am', 'AM'], ['pm', 'PM']];

  return result;
}

const weekInfo = {
  'af': [1, 4, 5], 'ar': [6, 1, 5, 6], 'ar-dz': [0, 3, 5, 6], 'ar-sa': [0, 1, 4, 5], 'az': [1, 1, 6, 0],
  'be': [1, 1, 6, 0], 'bg': [1, 1, 6, 0], 'bn': [0, 1, 6, 0], 'bn-bd': [0, 1, 6, 0], 'bo': [0, 1, 6, 0],
  'bs': [1, 1, 6, 0], 'en': [0, 1, 6, 0], 'en-au': [0, 3, 6, 0], 'en-ca': [0, 1, 6, 0], 'en-il': [0, 1, 5, 6],
  'eo': [1, 1, 6, 0], 'es-mx': [0, 3, 6, 0], 'es-us': [0, 1, 6, 0], 'eu': [1, 1, 6, 0], 'fa': [6, 1, 6, 0],
  'fr-ca': [0, 1, 6, 0], 'gu': [0, 1, 6, 0], 'hi': [0, 1, 6, 0], 'hr': [1, 1, 6, 0], 'hy-am': [1, 1, 6, 0],
  'ja': [0, 1, 6, 0], 'jv': [1, 1, 6, 0], 'ka': [1, 1, 6, 0], 'kk': [1, 1, 6, 0], 'kn': [0, 1, 6, 0],
  'ko': [0, 1, 6, 0], 'ku': [6, 1, 6, 0], 'ky': [1, 1, 6, 0], 'lo': [0, 1, 6, 0], 'mk': [1, 1, 6, 0],
  'ml': [0, 1, 6, 0], 'mn': [0, 1, 6, 0], 'mr': [0, 1, 5, 6], 'ms': [1, 1, 6, 0], 'ne': [0, 1, 6, 0],
  'pt-br': [0, 1, 6, 0], 'ro': [1, 1, 6, 0], 'sd': [1, 4, 5], 'si': [0, 1, 6, 0], 'sl': [1, 1, 6, 0],
  'sr': [1, 1, 6, 0], 'sw': [1, 1, 6, 0], 'ta': [0, 1, 6, 0], 'te': [0, 1, 6, 0], 'tg': [1, 1, 6, 0],
  'th': [0, 1, 6, 0], 'tk': [1, 1, 6, 0], 'tr': [1, 1, 6, 0], 'tzm': [6, 1, 6, 0], 'ug-cn': [1, 1, 6, 0],
  'uk': [1, 1, 6, 0], 'uz': [1, 1, 6, 0], 'zh': [0, 1, 6, 0]
};

function getWeekInfo(locale: string): number[] {
  let result: number[];

  locale = normalizeLocale(locale);

  do {
    result = weekInfo[locale];
    locale = reduceLocale(locale);
  } while (!result && locale.includes('-'));

  if (result == null)
    result = weekInfo.en;

  return result;
}

export function getStartOfWeek(locale: string): number {
  return getWeekInfo(locale)[0];
}

export function getMinDaysInWeek(locale: string): number {
  return getWeekInfo(locale)[1];
}

export function getWeekend(locale: string): number[] {
  return getWeekInfo(locale).slice(2);
}

// noinspection SpellCheckingInspection
const eras = {
  'ar': ['ق.م', 'م'], 'be': ['да н.е.', 'н.е.'], 'bg': ['пр.н.е.', 'н.е.'], 'ca': ['aC', 'dC'], 'cs': ['př.Kr.', 'po Kr.'],
  'da': ['f.Kr.', 'e.Kr.'], 'de': ['v. Chr.', 'n. Chr.'], 'el': ['π.Χ.', 'μ.Χ.'], 'es': ['antes de Cristo', 'anno Dómini'],
  'es-us': ['a.C.', 'd.C.'], 'et': ['e.m.a.', 'm.a.j.'], 'fi': ['eKr.', 'jKr.'], 'fr': ['BC', 'ap. J.-C.'],
  'ga': ['RC', 'AD'], 'hi-in': ['ईसापूर्व', 'सन'], 'hr': ['Prije Krista', 'Poslije Krista'], 'hu': ['i.e.', 'i.u.'],
  'in': ['BCE', 'CE'], 'is': ['f.Kr.', 'e.Kr.'], 'it': ['BC', 'dopo Cristo'], 'iw': ['לסה"נ', 'לפסה"נ'],
  'ja': ['紀元前', '西暦'], 'ko': ['기원전', '서기'], 'lt': ['pr.Kr.', 'po.Kr.'], 'lv': ['pmē', 'mē'], 'mk': ['пр.н.е.', 'ае.'],
  'ms': ['BCE', 'CE'], 'mt': ['QK', 'WK'], 'nb': ['f.Kr.', 'e.Kr.'], 'nl': ['v. Chr.', 'n. Chr.'], 'nn': ['f.Kr.', 'e.Kr.'],
  'no': ['f.Kr.', 'e.Kr.'], 'pl': ['p.n.e.', 'n.e.'], 'pt': ['a.C.', 'd.C.'], 'ro': ['d.C.', 'î.d.C.'],
  'ru': ['до н.э.', 'н.э.'], 'sk': ['pred n.l.', 'n.l.'], 'sl': ['pr.n.š.', 'po Kr.'], 'sq': ['p.e.r.', 'n.e.r.'],
  'sr': ['п. н. е.', 'н. е'], 'sr-ba-#latn': ['p. n. e.', 'n. e'], 'sr-me-#latn': ['p. n. e.', 'n. e'],
  'sr-rs-#latn': ['p. n. e.', 'n. e'], 'sr-xk-#latn': ['p. n. e.', 'n. e'], 'sr--#latn': ['p. n. e.', 'n. e'],
  'sv': ['före Kristus', 'efter Kristus'], 'th': ['ปีก่อนคริสต์กาลที่', 'ค.ศ.'], 'tr': ['MÖ', 'MS'],
  'uk': ['до н.е.', 'після н.е.'], 'vi': ['tr. CN', 'sau CN'], 'zh': ['公元前', '公元'], 'zh-tw': ['西元前', '西元'],
  'zh--#hant': ['西元前', '西元']
};

export function getEras(locale: string): string[] {
  let result: string[];

  locale = normalizeLocale(locale);

  do {
    result = eras[locale];
    locale = reduceLocale(locale);
  } while (!result && locale.includes('-'));

  if (result == null)
    result = ['BC', 'AD'];

  return result;
}
