export function normalizeLocale(name: string): string {
  if (!Intl?.DateTimeFormat)
    return 'en';

  return name.replace(/_/g, '-').toLowerCase();
}

/* eslint-disable quote-props */
// noinspection SpellCheckingInspection
const meridiems = {
  'af': [['vm', 'VM'], ['nm', 'NM']],
  'ar': [['ص'], ['م']],
  'az': [['gecə'], ['gecə'], ['gecə'], ['gecə'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam']],
  'be': [['ночы'], ['ночы'], ['ночы'], ['ночы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара']],
  'bn': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bn-bd': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['ভোর'], ['ভোর'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['সন্ধ্যা'], ['সন্ধ্যা'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bo': [['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['དགོང་དག'], ['དགོང་དག'], ['དགོང་དག'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ']],
  'br': [['a.m.'], ['g.m.']],
  'el': [['πμ', 'ΠΜ'], ['μμ', 'ΜΜ']],
  'eo': [['a.t.m.', 'A.T.M.'], ['p.t.m.', 'P.T.M.']],
  'fa': [['قبل از ظهر'], ['بعد از ظهر']],
  'gu': [['રાત'], ['રાત'], ['રાત'], ['રાત'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['સાંજ'], ['સાંજ'], ['સાંજ'], ['રાત'], ['રાત'], ['રાત'], ['રાત']],
  'hi': [['रात'], ['रात'], ['रात'], ['रात'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['शाम'], ['शाम'], ['शाम'], ['रात'], ['रात'], ['रात'], ['रात']],
  'hu': [['de', 'DE'], ['du', 'DU']],
  'hy': [['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան']],
  'ja': [['午前'], ['午後']],
  'jv': [['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['siyang'], ['siyang'], ['siyang'], ['siyang'], ['sonten'], ['sonten'], ['sonten'], ['sonten'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu']],
  'km': [['ព្រឹក'], ['ល្ងាច']],
  'kn': [['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ']],
  'ko': [['오전'], ['오후']],
  'ku': [['به‌یانی'], ['ئێواره‌']],
  'lo': [['ຕອນເຊົ້າ'], ['ຕອນແລງ']],
  'ml': [['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി']],
  'mn': [['ҮӨ'], ['ҮХ']],
  'mr': [['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['सायंकाळी'], ['सायंकाळी'], ['सायंकाळी'], ['रात्री'], ['रात्री'], ['रात्री'], ['रात्री']],
  'ms': [['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['tengahari'], ['tengahari'], ['tengahari'], ['tengahari'], ['petang'], ['petang'], ['petang'], ['petang'], ['malam'], ['malam'], ['malam'], ['malam'], ['malam']],
  'ne': [['राति'], ['राति'], ['राति'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['साँझ'], ['साँझ'], ['साँझ'], ['साँझ'], ['राति'], ['राति'], ['राति'], ['राति']],
  'ru': [['ночи'], ['ночи'], ['ночи'], ['ночи'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера']],
  'sd': [['صبح'], ['شام']],
  'si': [['පෙ.ව.', 'පෙර වරු'], ['ප.ව.', 'පස් වරු']],
  'sq': [['PD'], ['MD']],
  'ta': [[' யாமம்'], [' யாமம்'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' காலை'], [' காலை'], [' காலை'], [' காலை'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' மாலை'], [' மாலை'], [' மாலை'], [' மாலை'], [' யாமம்'], [' யாமம்']],
  'te': [['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['సాయంత్రం'], ['సాయంత్రం'], ['సాయంత్రం'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి']],
  'tg': [['шаб'], ['шаб'], ['шаб'], ['шаб'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['бегоҳ'], ['бегоҳ'], ['бегоҳ'], ['шаб'], ['шаб'], ['шаб'], ['шаб'], ['шаб']],
  'th': [['ก่อนเที่ยง'], ['หลังเที่ยง']],
  'tr': [['öö', 'ÖÖ'], ['ös', 'ÖS']],
  'ug': [['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['سەھەر'], ['سەھەر'], ['سەھەر'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈش'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ']],
  'uk': [['ночі'], ['ночі'], ['ночі'], ['ночі'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора']],
  'ur': [['صبح'], ['شام']],
  'vi': [['sa', 'SA'], ['ch', 'CH']],
  'zh': [['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['早上'], ['早上'], ['早上'], ['上午'], ['上午'], ['上午'], ['中午'], ['下午'], ['下午'], ['下午'], ['下午'], ['下午'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上']],
};

export function getMeridiems(locale: string): string[][] {
  let result: string[][] = null;

  locale = normalizeLocale(locale);

  do {
    result = meridiems[locale];
    locale = locale.replace(/-[^-]*?$/i, '');
  } while (!result && locale.includes('-'));

  if (!result)
    result = [['am', 'AM'], ['pm', 'PM']];

  return result;
}
