export const localeList = [
  'af', 'ar', 'ar-dz', 'ar-kw', 'ar-ly', 'ar-ma', 'ar-sa', 'ar-tn', 'az', 'be', 'bg', 'bm', 'bn', 'bn-bd',
  'bo', 'br', 'bs', 'ca', 'cs', 'cy', 'da', 'de', 'de-at', 'de-ch', 'el', 'en', 'en-au', 'en-ca', 'en-gb',
  'en-ie', 'en-il', 'en-in', 'en-nz', 'en-sg', 'eo', 'es', 'es-do', 'es-mx', 'es-us', 'et', 'eu', 'fa',
  'fi', 'fil', 'fo', 'fr', 'fr-ca', 'fr-ch', 'fy', 'ga', 'gd', 'gl', 'gu', 'hi', 'hr', 'hu', 'hy-am',
  'is', 'it', 'it-ch', 'ja', 'jv', 'ka', 'kk', 'km', 'kn', 'ko', 'ku', 'ky', 'lb', 'lo', 'lt', 'lv',
  'mi', 'mk', 'ml', 'mn', 'mr', 'ms', 'ms-my', 'mt', 'my', 'nb', 'ne', 'nl', 'nl-be', 'nn', 'pl', 'pt',
  'pt-br', 'ro', 'ru', 'sd', 'se', 'si', 'sk', 'sl', 'sq', 'sr', 'sv', 'sw', 'ta', 'te', 'tg', 'th',
  'tk', 'tr', 'tzm', 'ug-cn', 'uk', 'ur', 'uz', 'vi', 'yo', 'zh-cn', 'zh-hk', 'zh-tw'
];

export function normalizeLocale(name: string): string {
  if (!Intl?.DateTimeFormat)
    return 'en';

  return name.replace(/_/g, '-').toLowerCase();
}

function reduceLocale(locale: string): string {
  return locale.replace(/-[^-]*?$/i, '');
}

/* eslint-disable quote-props */
// noinspection SpellCheckingInspection
const meridiems = {
  'af': [['vm', 'VM'], ['nm', 'NM']],
  'ar': [['ص'], ['م']],
  'az': [['gecə'], ['gecə'], ['gecə'], ['gecə'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['səhər'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['gündüz'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam'], ['axşam']],
  'be': [['ночы'], ['ночы'], ['ночы'], ['ночы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['раніцы'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара'], ['вечара']],
  'bn': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bn-bd': [['রাত'], ['রাত'], ['রাত'], ['রাত'], ['ভোর'], ['ভোর'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['সকাল'], ['দুপুর'], ['দুপুর'], ['দুপুর'], ['বিকাল'], ['বিকাল'], ['বিকাল'], ['সন্ধ্যা'], ['সন্ধ্যা'], ['রাত'], ['রাত'], ['রাত'], ['রাত']],
  'bo': [['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཞོགས་ཀས'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['ཉིན་གུང'], ['དགོང་དག'], ['དགོང་དག'], ['དགོང་དག'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ'], ['མཚན་མོ']],
  'br': [['a.m.'], ['g.m.']],
  'el': [['πμ', 'ΠΜ'], ['μμ', 'ΜΜ']],
  'eo': [['a.t.m.', 'A.T.M.'], ['p.t.m.', 'P.T.M.']],
  'fa': [['قبل از ظهر'], ['بعد از ظهر']],
  'gu': [['રાત'], ['રાત'], ['રાત'], ['રાત'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['સવાર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['બપોર'], ['સાંજ'], ['સાંજ'], ['સાંજ'], ['રાત'], ['રાત'], ['રાત'], ['રાત']],
  'hi': [['रात'], ['रात'], ['रात'], ['रात'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['सुबह'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['दोपहर'], ['शाम'], ['शाम'], ['शाम'], ['रात'], ['रात'], ['रात'], ['रात']],
  'hu': [['de', 'DE'], ['du', 'DU']],
  'hy': [['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['գիշերվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['առավոտվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['ցերեկվա'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան'], ['երեկոյան']],
  'ja': [['午前'], ['午後']],
  'jv': [['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['enjing'], ['siyang'], ['siyang'], ['siyang'], ['siyang'], ['sonten'], ['sonten'], ['sonten'], ['sonten'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu'], ['ndalu']],
  'km': [['ព្រឹក'], ['ល្ងាច']],
  'kn': [['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಬೆಳಿಗ್ಗೆ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಮಧ್ಯಾಹ್ನ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ಸಂಜೆ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ'], ['ರಾತ್ರಿ']],
  'ko': [['오전'], ['오후']],
  'ku': [['به‌یانی'], ['ئێواره‌']],
  'lo': [['ຕອນເຊົ້າ'], ['ຕອນແລງ']],
  'ml': [['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['രാവിലെ'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['ഉച്ച കഴിഞ്ഞ്'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['വൈകുന്നേരം'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി'], ['രാത്രി']],
  'mn': [['ҮӨ'], ['ҮХ']],
  'mr': [['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['पहाटे'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['सकाळी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['दुपारी'], ['सायंकाळी'], ['सायंकाळी'], ['सायंकाळी'], ['रात्री'], ['रात्री'], ['रात्री'], ['रात्री']],
  'ms': [['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['pagi'], ['tengahari'], ['tengahari'], ['tengahari'], ['tengahari'], ['petang'], ['petang'], ['petang'], ['petang'], ['malam'], ['malam'], ['malam'], ['malam'], ['malam']],
  'ne': [['राति'], ['राति'], ['राति'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['बिहान'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['दिउँसो'], ['साँझ'], ['साँझ'], ['साँझ'], ['साँझ'], ['राति'], ['राति'], ['राति'], ['राति']],
  'ru': [['ночи'], ['ночи'], ['ночи'], ['ночи'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['утра'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера'], ['вечера']],
  'sd': [['صبح'], ['شام']],
  'si': [['පෙ.ව.', 'පෙර වරු'], ['ප.ව.', 'පස් වරු']],
  'sq': [['PD'], ['MD']],
  'ta': [[' யாமம்'], [' யாமம்'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' வைகறை'], [' காலை'], [' காலை'], [' காலை'], [' காலை'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' நண்பகல்'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' எற்பாடு'], [' மாலை'], [' மாலை'], [' மாலை'], [' மாலை'], [' யாமம்'], [' யாமம்']],
  'te': [['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['ఉదయం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['మధ్యాహ్నం'], ['సాయంత్రం'], ['సాయంత్రం'], ['సాయంత్రం'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి'], ['రాత్రి']],
  'tg': [['шаб'], ['шаб'], ['шаб'], ['шаб'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['субҳ'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['рӯз'], ['бегоҳ'], ['бегоҳ'], ['бегоҳ'], ['шаб'], ['шаб'], ['шаб'], ['шаб'], ['шаб']],
  'th': [['ก่อนเที่ยง'], ['หลังเที่ยง']],
  'tr': [['öö', 'ÖÖ'], ['ös', 'ÖS']],
  'ug': [['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['يېرىم كېچە'], ['سەھەر'], ['سەھەر'], ['سەھەر'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈشتىن بۇرۇن'], ['چۈش'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['چۈشتىن كېيىن'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ'], ['كەچ']],
  'uk': [['ночі'], ['ночі'], ['ночі'], ['ночі'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['ранку'], ['дня'], ['дня'], ['дня'], ['дня'], ['дня'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора'], ['вечора']],
  'ur': [['صبح'], ['شام']],
  'vi': [['sa', 'SA'], ['ch', 'CH']],
  'zh': [['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['凌晨'], ['早上'], ['早上'], ['早上'], ['上午'], ['上午'], ['上午'], ['中午'], ['下午'], ['下午'], ['下午'], ['下午'], ['下午'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上'], ['晚上']],
};

export function getMeridiems(locale: string): string[][] {
  let result: string[][] = null;

  locale = normalizeLocale(locale);

  do {
    result = meridiems[locale];
    locale = reduceLocale(locale);
  } while (!result && locale.includes('-'));

  if (!result)
    result = [['am', 'AM'], ['pm', 'PM']];

  return result;
}

const weekStarts = {
  'af': 1, 'ar': 6, 'ar-dz': 0, 'ar-kw': 0, 'ar-ma': 1, 'ar-sa': 0, 'ar-tn': 1, 'az': 1,
  'be': 1, 'bg': 1, 'bm': 1, 'bn': 0, 'bo': 0, 'br': 1, 'bs': 1, 'ca': 1, 'cs': 1, 'cy': 1,
  'da': 1, 'de': 1, 'el': 1, 'en': 0, 'en-gb': 1, 'en-ie': 1, 'en-nz': 1, 'en-sg': 1, 'eo': 1,
  'es': 1, 'es-mx': 0, 'es-us': 0, 'et': 1, 'eu': 1, 'fa': 6, 'fi': 1, 'fil': 1, 'fo': 1,
  'fr': 1, 'fr-ca': 0, 'fy': 1, 'ga': 1, 'gd': 1, 'gl': 1, 'gu': 0, 'hi': 0, 'hr': 1, 'hu': 1,
  'hy-am': 1, 'is': 1, 'it': 1, 'ja': 0, 'jv': 1, 'ka': 1, 'kk': 1, 'km': 1, 'kn': 0, 'ko': 0,
  'ku': 6, 'ky': 1, 'lb': 1, 'lo': 0, 'lt': 1, 'lv': 1, 'mi': 1, 'mk': 1, 'ml': 0, 'mn': 0,
  'mr': 0, 'ms': 1, 'mt': 1, 'my': 1, 'nb': 1, 'ne': 0, 'nl': 1, 'nn': 1, 'pl': 1, 'pt': 1,
  'pt-br': 0, 'ro': 1, 'ru': 1, 'sd': 1, 'se': 1, 'si': 0, 'sk': 1, 'sl': 1, 'sq': 1, 'sr': 1,
  'sv': 1, 'sw': 1, 'ta': 0, 'te': 0, 'tg': 1, 'th': 0, 'tk': 1, 'tr': 1, 'tzm': 6, 'ug-cn': 1,
  'uk': 1, 'ur': 1, 'uz': 1, 'vi': 1, 'yo': 1, 'zh': 1, 'zh-hk': 0, 'zh-tw': 0
};

export function getStartOfWeek(locale: string): number {
  let result: number;

  locale = normalizeLocale(locale);

  do {
    result = weekStarts[locale];
    locale = reduceLocale(locale);
  } while (!result && locale.includes('-'));

  if (result == null)
    result = 0;

  return result;
}
